Revit 2026 API

# FailureDefinitionId Operators

---

The FailureDefinitionId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equality(FailureDefinitionId, FailureDefinitionId) | Compares two FailureDefinitionId instances. |
|  | Inequality(FailureDefinitionId, FailureDefinitionId) | Compares two FailureDefinitionId instances. |

#### Reference

FailureDefinitionId Class

Autodesk.Revit.DB Namespace